app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(comment_params)

    if @comment.save
---
INSERT INTO "comments" ("text", "user_id", "discussion_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["text", "hjgjg"], ["user_id", 2], ["discussion_id", 7], ["created_at", "2020-05-21 22:54:52.824952"], ["updated_at", "2020-05-21 22:54:52.824952"]]

  def find_by_discussion
    puts '@discussion.text'
    puts params[:discussion_id]
    @discussion = Discussion.find(params[:discussion_id])
---
SELECT "discussions".* FROM "discussions" WHERE "discussions"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]