app/controllers/discussions_controller.rb

  def index
    @discussions = Discussion.all
---
SELECT "discussions".* FROM "discussions"

  def create
    @discussion = Discussion.new(discussion_params)

    if @discussion.save
---
INSERT INTO "discussions" ("text", "profile_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["text", "first thread by Pam"], ["profile_id", 2], ["user_id", 2], ["created_at", "2020-05-21 21:36:59.005553"], ["updated_at", "2020-05-21 21:36:59.005553"]]

  def destroy
    @discussion.destroy
---
DELETE FROM "discussions" WHERE "discussions"."id" = $1  [["id", 1]]

    def set_discussion
      @discussion = Discussion.find(params[:id])
---
SELECT "discussions".* FROM "discussions" WHERE "discussions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]