app/controllers/interests_controller.rb

SELECT "interests".* FROM "interests"
---
  def index
    @interests = Interest.all

SELECT "interests".* FROM "interests" WHERE "interests"."text" = $1  [["text", "skupiti"]]
---
  def find_by_key
    @interests = Interest.where({text: params[:keyword]})

SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def find_by_profile
    @profile = Profile.find(params[:profile_id])

SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "interests" ("text", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["text", "dasd"], ["created_at", "2020-05-20 01:18:55.793804"], ["updated_at", "2020-05-20 01:18:55.793804"]]
---
  def create

    @interest = Interest.new(interest_params)
    @profile = Profile.find(params[:profile_id])
    if  @interest.save

SELECT "interests".* FROM "interests" WHERE "interests"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
INSERT INTO "interests" ("text", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["text", "skiing"], ["created_at", "2020-05-20 01:30:45.300150"], ["updated_at", "2020-05-20 01:30:45.300150"]]
---
  def add_profile
    @interest = Interest.find(params[:interest_id])
    @profile = Profile.find(params[:profile_id])

    @interest.profiles << @profile

SELECT "interests".* FROM "interests" WHERE "interests"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
    def set_interest
      @interest = Interest.find(params[:id])