app/controllers/profiles_controller.rb

  def show
    @profile = Profile.where({user_id: params[:user_id]})
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]

  def find_profile
    @profile = Profile.where({user_id: params[:user_id]})
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."user_id" = $1  [["user_id", 5]]

  def show_by_interest
    @interest = Interest.find(params[:interest_id])
---
SELECT "interests".* FROM "interests" WHERE "interests"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]

  def create
    @profile = Profile.new(profile_params)

    if @profile.save
---
INSERT INTO "profiles" ("full_name", "title", "department", "status", "created_at", "updated_at", "user_id", "twitter_url", "linkedin_url", "ig_url", "website_url", "mobile", "landline", "personal_email", "business_address", "office", "img_url", "timezone") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18) RETURNING "id"

  def update
    if @profile.update(profile_params)
---
UPDATE "profiles" SET "title" = $1, "department" = $2, "status" = $3, "timezone" = $4, "linkedin_url" = $5, "twitter_url" = $6, "ig_url" = $7, "website_url" = $8, "mobile" = $9, "landline" = $10, "personal_email" = $11, "business_address" = $12, "office" = $13, "updated_at" = $14 WHERE "profiles"."id" = $15